[
  "quick-latex",
  "obsidian-pandoc",
  "obsidian-style-settings",
  "obsidian-regex-replace",
  "table-editor-obsidian",
  "obsidian-functionplot",
  "dataview",
  "obsidian-icon-folder",
  "obsidian-excalidraw-plugin",
  "obsidian-git",
  "obsidian-charts",
  "hard-breaks",
  "helix"
]