Министерство образования и науки РФ
Федеральное государственное бюджетное учреждение высшего образования
Череповецкий государственный университет
Институт информационных технологий

Отчёт по лабораторной работе 7
"Текстовые файлы"

Выполнил
ст. группы 1ПИб-02-3оп-22
Артемий. А. Беляков 
Проверил:
ст. преп.
Табунов П.А.

Задание
1.  Текстовый файл разбит на непустые строки. Составить программу для подсчета числа строк, которые начинаются и оканчиваются одним и тем же символом.
```c
#include <iostream>  
#include <string.h>  
  
using namespace std;  
  
int main() {  
    FILE *filePointer;  
    filePointer = fopen("../thing.txt", "r");  
    char currString[100];  
    int count = 0;  
    int strLen;  
  
    while (fgets(currString, 100, filePointer)) {  
        if (currString[strlen(currString) - 1] == '\n') {  
            strLen = strlen(currString) - 2;  
        }  
        else {  
            strLen = strlen(currString) - 1;  
        }  
        if (currString[0] == currString[strLen]) {  
            count++;  
        }  
    }  
    printf("%d", count);  
    return 0;  
}
```
```c++
#include <iostream>  
#include <string>  
#include <fstream>  
  
using namespace std;  
  
int main() {  
    ifstream file;  
    string line;  
    int count = 0;  
    file.open("../thing.txt");  
    while (getline(file, line)) {  
        if (line[0] == line[line.length() - 1]) {  
            count++;  
        }  
    }  
    cout << count;  
}
```